20230823193630-ipv6_address.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IPv6 address</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">IPv6 address</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org85a3fcc">1. Shortening an <code>IPv6 address</code>:</a></li>
<li><a href="#org140e605">2. Anatomy</a></li>
<li><a href="#org07111a2">3. Reserved Address Spaces</a></li>
<li><a href="#org2e603b3">4. Header</a>
<ul>
<li><a href="#org1529eda">4.1. Version Field</a></li>
<li><a href="#orgfcf03f7">4.2. Traffic Class Field</a></li>
<li><a href="#org8241707">4.3. Flow Label Field</a></li>
<li><a href="#org748a00e">4.4. Payload Length Field</a></li>
<li><a href="#org99240f6">4.5. Next Header Field</a></li>
<li><a href="#org26d6cde">4.6. Hop Limit Field</a></li>
<li><a href="#org895285f">4.7. Source Field</a></li>
<li><a href="#org0fa0ee0">4.8. Destination Field</a></li>
</ul>
</li>
<li><a href="#orga25766e">5. Payload</a></li>
<li><a href="#org6051912">6. IPv6 Tunnels</a></li>
</ul>
</div>
</div>

<div id="outline-container-org85a3fcc" class="outline-2">
<h2 id="org85a3fcc"><span class="section-number-2">1.</span> Shortening an <code>IPv6 address</code>:</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Remove any leading zeros from a group.</li>
<li>Any number of consecutive groups composed of just zeros can be replaced with two colons <code>::</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-org140e605" class="outline-2">
<h2 id="org140e605"><span class="section-number-2">2.</span> Anatomy</h2>
<div class="outline-text-2" id="text-2">
<p>
NetworkID: First <b>64 bits</b>
HostID: Second <b>64 bits</b>
</p>
</div>
</div>

<div id="outline-container-org07111a2" class="outline-2">
<h2 id="org07111a2"><span class="section-number-2">3.</span> Reserved Address Spaces</h2>
<div class="outline-text-2" id="text-3">
<p>
Documentation: Start with <code>2001:0db8</code>
If it starts with <code>FF00:xxx</code> <a href="20230821054705-multicast.html#ID-c4309265-ff27-4592-85f6-3ed4ea47fc18">Multicast</a>
If it starts with <code>FE80:xxx</code> <a href="20230823194006-link_local_unicast.html#ID-4bb840ff-f8f4-472b-845b-597ebda44648">Link-Local Unicast</a>
</p>
</div>
</div>

<div id="outline-container-org2e603b3" class="outline-2">
<h2 id="org2e603b3"><span class="section-number-2">4.</span> Header</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1529eda" class="outline-3">
<h3 id="org1529eda"><span class="section-number-3">4.1.</span> Version Field</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>4 bit</b>
Defines what version of IP is in use
</p>
</div>
</div>

<div id="outline-container-orgfcf03f7" class="outline-3">
<h3 id="orgfcf03f7"><span class="section-number-3">4.2.</span> Traffic Class Field</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<b>8 bit</b>
Defines type of traffic contained within datagram
</p>
</div>
</div>

<div id="outline-container-org8241707" class="outline-3">
<h3 id="org8241707"><span class="section-number-3">4.3.</span> Flow Label Field</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<b>20 bit</b>
Used in conjunction with <code>Traffic Class field</code> for <a href="20230819075407-router.html#ID-88dd44ee-b7ff-4a29-9048-10709d05bb8e">routers</a> to make decisions about the quality of service level for a specific datagram.
</p>
</div>
</div>

<div id="outline-container-org748a00e" class="outline-3">
<h3 id="org748a00e"><span class="section-number-3">4.4.</span> Payload Length Field</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<b>16 bit</b>
Defines how long data payload section of datagram is.
</p>
</div>
</div>

<div id="outline-container-org99240f6" class="outline-3">
<h3 id="org99240f6"><span class="section-number-3">4.5.</span> Next Header Field</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<b>16 bit</b>
Optional
</p>
</div>
</div>

<div id="outline-container-org26d6cde" class="outline-3">
<h3 id="org26d6cde"><span class="section-number-3">4.6.</span> Hop Limit Field</h3>
<div class="outline-text-3" id="text-4-6">
<p>
<b>8 bit</b>
Identical to TTL Field in IPv4 Header
</p>
</div>
</div>

<div id="outline-container-org895285f" class="outline-3">
<h3 id="org895285f"><span class="section-number-3">4.7.</span> Source Field</h3>
<div class="outline-text-3" id="text-4-7">
<p>
<b>128 bit</b>
</p>
</div>
</div>

<div id="outline-container-org0fa0ee0" class="outline-3">
<h3 id="org0fa0ee0"><span class="section-number-3">4.8.</span> Destination Field</h3>
<div class="outline-text-3" id="text-4-8">
<p>
<b>128 bit</b>
</p>
</div>
</div>
</div>

<div id="outline-container-orga25766e" class="outline-2">
<h2 id="orga25766e"><span class="section-number-2">5.</span> Payload</h2>
</div>

<div id="outline-container-org6051912" class="outline-2">
<h2 id="org6051912"><span class="section-number-2">6.</span> <a href="20230823195003-ipv6_tunnels.html#ID-b08f93ee-0bc2-4f6b-badb-42eda2c958fd">IPv6 Tunnels</a></h2>
</div>
</div>
</body>
</html>
